# Data Science
#### By: Javier Orduz
[license-badge]: https://img.shields.io/badge/License-CC-orange
[license]: https://creativecommons.org/licenses/by-nc-sa/3.0/deed.en
[![CC License][license-badge]][license]
[![DS](https://img.shields.io/badge/downloads-DS-green)](https://github.com/Earlham-College/DS_Fall_2022)
[![Github](https://img.shields.io/badge/jaorduz-repos-blue)](https://github.com/jaorduz/)
[![Github](https://img.shields.io/badge/jaorduc-repos-blue)](https://github.com/jaorduc/)
![Follow @jaorduc](https://img.shields.io/twitter/follow/jaorduc?label=follow&logo=twitter&logoColor=lkj&style=plastic)

<div class="alert  alert-block alert-info" style="margin-top: 1px">
    <ol>
        <li><a href="#unData">Import modules</a></li>
         <!-- <ol>
             <li><a href="#reData">Reading</a></li>
         </ol> -->
        <li><a href="#daExploration">Read CSV</a></li>
        <li><a href="#showData">Grouping data</a></li>
        <li><a href="#exerci">Exercises</a></li>
    </ol>
</div>
<br>
<hr>

In [1]:
import matplotlib.pyplot as plt
import pandas as pd
import pylab as pl
import numpy as np
%matplotlib inline

### Part II: Simpler Linear Regression. Knowing data

Data source [0].

In [2]:
df = pd.read_csv("../../data/titanic3.csv")

In [3]:
df.head(5)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [4]:
df['sex'] = np.where(df['sex']=='female',1, 0)

In [5]:
df.head(5)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",1,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",0,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",1,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",0,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [6]:
df.describe()

,pclass,survived,sex,age,sibsp,parch,fare,body
count,1309.000000,1309.000000,1309.000000,1046.000000,1309.000000,1309.000000,1308.000000,121.000000
mean,2.294882,0.381971,0.355997,29.881138,0.498854,0.385027,33.295479,160.809917
std,0.837836,0.486055,0.478997,14.413493,1.041658,0.865560,51.758668,97.696922
min,1.000000,0.000000,0.000000,0.170000,0.000000,0.000000,0.000000,1.000000
25%,2.000000,0.000000,0.000000,21.000000,0.000000,0.000000,7.895800,72.000000
50%,3.000000,0.000000,0.000000,28.000000,0.000000,0.000000,14.454200,155.000000
75%,3.000000,1.000000,1.000000,39.000000,1.000000,0.000000,31.275000,256.000000
max,3.000000,1.000000,1.000000,80.000000,8.000000,9.000000,512.329200,328.000000

To fix ```NULL``` data

In [ ]:
df.isnull().sum()

In [ ]:
print(sum(df['age'].isnull()))

In [ ]:
df['age'].mean()

In [ ]:
df['fare'].mean()

In [ ]:
df['age'].fillna(df['age'].mean(), inplace = True)

In [ ]:
df['fare'].fillna(df['fare'].mean(), inplace = True)

In [ ]:
df.isnull().sum()

In [ ]:
print(sum(df['age'].isnull()))

Group by sex, show mean value

In [ ]:
df.groupby('sex').mean()

In [ ]:
df.groupby('sex')['age'].mean()

##  Exercises

1. For Sex column, you must change to 1 if the passenger was female and 0 if they were male. 
1. There some missing data, find a function to find the missing information in each column.
1. If you found some missing data, then you have two options: 
    - fill it in. Recommended
    - Drop the rows with the missing values.
1. Print the null values for each columns.
1. Get the average value for those columns that have any missing values.
1. Remove the null values, and replace them with the mean value.
1. Print how many values are nulls.
1. Filter the database by each gender, and find the mean.
    - You can filter using groupby method.
1. Submmit your report in Moodle. Template https://www.overleaf.com/read/xqcnnnrsspcp

## Versions

In [ ]:
from platform import python_version
print("python version: ", python_version())
!pip3 freeze | grep qiskit

# References

[0] data https://tinyurl.com/2m3vr2xp

[1] numpy https://numpy.org/

[2] scipy https://docs.scipy.org/

[3] matplotlib https://matplotlib.org/

[4] matplotlib.cm https://matplotlib.org/stable/api/cm_api.html

[5] matplotlib.pyplot https://matplotlib.org/stable/api/pyplot_summary.html

[6] pandas https://pandas.pydata.org/docs/

[7] seaborn https://seaborn.pydata.org/